#### NonContinuousRailStructure Members

---

|  |
| --- |
| NonContinuousRailStructure Class   Methods   Properties   See Also |

The  NonContinuousRailStructure  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddNonContinuousRail | Creates and appends a new Non-Continuous Rail to the Rail Structure. The new Non-Continuous Rail will have the given name, height and offset. It will have default profile and material ElementIds. |
| Public method | Dispose | Releases all resources used by the  NonContinuousRailStructure |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetNonContinuousRail | Gets the Non-Continuous Rail object of specified index from the Rail Structure. |
| Public method | GetNonContinuousRailCount | Gets number of Non-Continuous Rails. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsValidNonContinuousRailProfile | Checks whether the input id represents a profile which can be used as the profile of this non-continuous rail. |
| Public method | RemoveNonContinuousRail | Removes Non-Continuous Rail from the Rail Structure. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

NonContinuousRailStructure Class

Autodesk.Revit.DB.Architecture Namespace